backend/controllers/ClientsController.php

INSERT INTO `clients` (`username`, `country_id`, `note`, `status`, `payment_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Client1', 11, 'some text', 1, 1, 1, 1529830298, 1529830298)
---
    public function actionCreate()
    {
        $model = new Clients();

        if ($model->load(Yii::$app->request->post('Clients'), '') && $model->save(false)) {

SELECT * FROM `clients` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Clients::findOne($id)) !== null) {