backend/controllers/PaymentMethodsController.php

    protected function findModel($id)
    {
        if (($model = PaymentMethods::findOne($id)) !== null) {
---
SELECT * FROM `payment_methods` WHERE `id`='1'