backend/views/user/index.php

SELECT COUNT(*) FROM `user`
---
            ['class' => 'yii\grid\SerialColumn'],
            'id',
            'username',
            'name',
            'email:email',
            'type',
            'company_name',
            [
                'attribute' => 'country_id',
                'filter' => Clients::getCountries(),
                'options' => [
                    'width' => 170,
                ],
                'content' => function($model) { return $model->country->name_en; },
            ],
            [
                'attribute' => 'status',
                'filter' => [10 => "Active", 0 => "Inactive"],
                'options' => [
                    'width' => 170,
                ],
                'content' => function($model) { return \app\models\User::getStatus($model->status); },
            ],
        ],