backend/views/clients/index.php

SELECT * FROM `clients` WHERE `user_id`=1 LIMIT 20
SELECT COUNT(*) FROM `clients` WHERE `user_id`=1
---
        <?= Html::a('Create Clients', ['create'], ['class' => 'btn btn-success']) ?>
    </p>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],
            'id',
            'username',
            [
                'attribute' => 'country_id',
                'filter' => Clients::getCountries(),
                'options' => [
                    'width' => 170,
                ],
                'content' => function($model) { return $model->country->name_en; },
            ],
            'note',
            [
                'attribute' => 'status',
                'filter' => [1 => "Active", 0 => "Inactive", -1 => "Blacklisted"],
                'options' => [
                    'width' => 170,
                ],