backend/models/Clients.php

    public static function getCountries()
    {
        $model = Countries::find()->all();
---
SELECT * FROM `countries`

    public static function getPayments()
    {
        $model = PaymentMethods::find()->where(['user_id' => Yii::$app->user->id])->all();
---
SELECT * FROM `payment_methods` WHERE `user_id`=1